Revit 2027 API
MEPAnalyticalModelData.IsValidSegmentId Method
 Verifies if a valid segment id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSegmentId(
	int segmentId
)
Public Function IsValidSegmentId (
	segmentId As Integer
) As Boolean
public:
bool IsValidSegmentId(
	int segmentId
)
member IsValidSegmentId :
        segmentId : int -> bool
Parameters
segmentId Int32
 The segment id to be verified.
Return Value
Boolean
 True if the id is a valid segment id, otherwise false.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace